{
    "person": {
        "role": "Software Engineer",
        "firstName": "Wishwa",
        "lastName":  "Kankanamage"
    },
    "newsletter": {
        "title": "Subscribe to {firstName}'s Newsletter",
        "description": "I occasionally write about design, technology, and share thoughts on the intersection of creativity and engineering",
        "button": "Sign up"
    },
    "certificate": {
        "title": "University of Westminster",
        "description": "School of Computer Science and Engineering",
        "program": "Business Information Systems with Upper Second Class Honours"
    },
    "home": {
        "label": "Home",
        "title": "{name}'s Portfolio",
        "description": "Portfolio website showcasing my work as a {role}",
        "headline": "Full Stack Software Engineer",
        "subline": "I'm Wishwa, a full stack software engineer building sustainable and impactful solutions by combining the precision of engineering with the creativity of design."
    },
    "about": {
        "label": "About",
        "title": "About me",
        "description": "Meet {name}, {role} from {location}",
        "intro": {
            "title": "Introduction",
            "description": "Wishwa is a software engineer with experience building client/server desktop, web and mobile applications, middleware systems and database primarily based on the java platform. Wishwa has a keen interest in learning and working with Go, multithreaded applications, the Internet's WebAssembly adaptation, and Linux."
        },
        "work": {
            "title": "Work Experience",
            "experiences": {
                "FLY": {
                    "name": "Webs R Us",
                    "timeframe": "Aug 2024 - February 2025",
                    "role": "Full Stack Developer",
                    "achievements": "Designed and developed travel application which enables users to create iternaries and book hotels through booking.com API.;Developed application in offline first approach to ensure users are capable of utilizing all the features provided by the application in low coverage areas.;Developed functionality to share iternaries and view live changes made by other users using supabase realtime features.;Developed backend web service using GIN(go) framework to ensure all the write operations are sent through backend RESTful web service including necessary api calls to provide route optimization and budget calculations features."
                },
                "WAD": {
                    "name": "We are designers",
                    "timeframe": "Jul 2022 - Jun 2023",
                    "role": "Quality Assurance Intern",
                    "achievements": "Worked for both mobile and web development teams.;Wrote automated tests using Selenium, performed UI testing and crossbrowser compatibility testing, and performance testing throughout theSDLC for 2 wordpress and laravel websites of well established Sri Lankan organizations and 4 single-page websites.;Designed and wrote test cases for mobile and tablet version of booking and reservation application which currently has 200 clients and a 'buy one, get one free' entertainment app for a well-known Sri Lankan trade-partnership which currently has 10,000 downloads and an average 4.5 rating.;Used JMeter to perform load testing on laravel applications.;Collaborated with team members and project stakeholders to ensure timely and accurate delivery of software products.;Managed bug fixing process using Mantis bug tracker software."
                }
            }
        },
        "studies": {
            "title": "Studies",
            "institutions": {
                "University of Westminster": {
                    "name": "University of Westminster",
                    "faculty": "School of Computer Science and Engineering",
                    "description": "Studied Business Information Systems."
                }
            }
        },
        "technical": {
            "title": "Technical skills",
            "skills": {
                "Particularly interested in": {
                    "description": "go, gin, next.Js, kotlin multi platform, general software design, software development process, agile, performance, scalability, multithreading, security, distributed and cloud computing"
                },
                "Libraries": {
                    "description": "django, flask, express.Js, spring boot, flutter, gin, prisma, next.js, react, vue, react native, typeScript, selenium, sci-kit learn, open CV, rive, framer, intl.js, three.js, PDF.js,"
                },
                "Computer Languages": {
                    "description": "Java, Python, C/C++/C#, JavaScript, Kotlin, Go, PHP, SQL, HTML, CSS, Sass, JSON, YAML, CSV, R"
                },
                "Specialities": {
                    "description": "django, django ORM, typescript, Once UI, tailwind, react, react context API, react Query, flutter, riverpod, supabase, neonDB, configuring CI/CD using git or vercel, RESTful web services, Amazon EC2/ S3/ MQ / SQS, pytorch."
                },
                "Certifications": {
                    "description": "Google Data Analytics Professional Certificate., working on AWS Certified Developer - Associate."
                }
            }
        }
    },
    "blog": {
        "label": "Blog",
        "title": "Writing about design and tech...",
        "description": "Read what {name} has been up to recently"
    },
    "work": {
        "label": "Work",
        "title": "My projects",
        "description": "Design and dev projects by {name}"
    },
    "gallery": {
        "label": "Gallery",
        "title": "My photo gallery",
        "description": "A photo collection by {name}"
    },
    "projectCard": {
        "label": "Read Case Study"
    }
}